thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc26x0/inc/hw_adi.h
#define ADI_SLAVECONF_ADICLKSPEED_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_MASK4B01 register.
//
//*****************************************************************************
#define ADI_MASK4B01_M1H_M      0xF0000000  // Mask for bits [7:4] in ADI
// register 1
#define ADI_MASK4B01_M1H_S      28
#define ADI_MASK4B01_D1H_M      0x0F000000  // Data for bits [7:4] in ADI
// register 1, - only bits selected
// by mask M1H will be affected by
// access
#define ADI_MASK4B01_D1H_S      24
#define ADI_MASK4B01_M1L_M      0x00F00000  // Mask for bits [3:0] in ADI
// register 1
#define ADI_MASK4B01_M1L_S      20
#define ADI_MASK4B01_D1L_M      0x000F0000  // Data for bits [3:0] in ADI
// register 1, - only bits selected
// by mask M1L will be affected by
// access
#define ADI_MASK4B01_D1L_S      16
#define ADI_MASK4B01_M0H_M      0x0000F000  // Mask for bits [7:4] in ADI
// register 0
#define ADI_MASK4B01_M0H_S      12
#define ADI_MASK4B01_D0H_M      0x00000F00  // Data for bits [7:4] in ADI
// register 0, - only bits selected
// by mask M0H will be affected by
// access
#define ADI_MASK4B01_D0H_S      8
#define ADI_MASK4B01_M0L_M      0x000000F0  // Mask for bits [3:0] in ADI
// register 0
#define ADI_MASK4B01_M0L_S      4
#define ADI_MASK4B01_D0L_M      0x0000000F  // Data for bits [3:0] in ADI
// register 0, - only bits selected
// by mask M0L will be affected by
// access
#define ADI_MASK4B01_D0L_S      0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_MASK4B23 register.
//
//*****************************************************************************
#define ADI_MASK4B23_M1H_M      0xF0000000  // Mask for bits [7:4] in ADI
// register 3
#define ADI_MASK4B23_M1H_S      28
#define ADI_MASK4B23_D1H_M      0x0F000000  // Data for bits [7:4] in ADI
// register 3, - only bits selected
// by mask M1H will be affected by
// access
#define ADI_MASK4B23_D1H_S      24
#define ADI_MASK4B23_M1L_M      0x00F00000  // Mask for bits [3:0] in ADI
// register 3
#define ADI_MASK4B23_M1L_S      20
#define ADI_MASK4B23_D1L_M      0x000F0000  // Data for bits [3:0] in ADI
// register 3, - only bits selected
// by mask M1L will be affected by
// access
#define ADI_MASK4B23_D1L_S      16
#define ADI_MASK4B23_M0H_M      0x0000F000  // Mask for bits [7:4] in ADI
// register 2
#define ADI_MASK4B23_M0H_S      12
#define ADI_MASK4B23_D0H_M      0x00000F00  // Data for bits [7:4] in ADI
// register 2, - only bits selected
// by mask M0H will be affected by
// access
#define ADI_MASK4B23_D0H_S      8
#define ADI_MASK4B23_M0L_M      0x000000F0  // Mask for bits [3:0] in ADI
// register 2
#define ADI_MASK4B23_M0L_S      4
#define ADI_MASK4B23_D0L_M      0x0000000F  // Data for bits [3:0] in ADI
// register 2, - only bits selected
// by mask M0L will be affected by
// access
#define ADI_MASK4B23_D0L_S      0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_MASK4B45 register.
//
//*****************************************************************************
#define ADI_MASK4B45_M1H_M      0xF0000000  // Mask for bits [7:4] in ADI
// register 5
#define ADI_MASK4B45_M1H_S      28
#define ADI_MASK4B45_D1H_M      0x0F000000  // Data for bits [7:4] in ADI
// register 5, - only bits selected
// by mask M1H will be affected by
// access
#define ADI_MASK4B45_D1H_S      24
#define ADI_MASK4B45_M1L_M      0x00F00000  // Mask for bits [3:0] in ADI
// register 5
#define ADI_MASK4B45_M1L_S      20
#define ADI_MASK4B45_D1L_M      0x000F0000  // Data for bits [3:0] in ADI
// register 5, - only bits selected
// by mask M1L will be affected by
// access
#define ADI_MASK4B45_D1L_S      16
#define ADI_MASK4B45_M0H_M      0x0000F000  // Mask for bits [7:4] in ADI
// register 4
#define ADI_MASK4B45_M0H_S      12
#define ADI_MASK4B45_D0H_M      0x00000F00  // Data for bits [7:4] in ADI
// register 4, - only bits selected
// by mask M0H will be affected by
// access
#define ADI_MASK4B45_D0H_S      8
#define ADI_MASK4B45_M0L_M      0x000000F0  // Mask for bits [3:0] in ADI
// register 4
#define ADI_MASK4B45_M0L_S      4
#define ADI_MASK4B45_D0L_M      0x0000000F  // Data for bits [3:0] in ADI
// register 4, - only bits selected
// by mask M0L will be affected by
// access
#define ADI_MASK4B45_D0L_S      0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_MASK4B67 register.
//
//*****************************************************************************
#define ADI_MASK4B67_M1H_M      0xF0000000  // Mask for bits [7:4] in ADI
// register 7
#define ADI_MASK4B67_M1H_S      28
#define ADI_MASK4B67_D1H_M      0x0F000000  // Data for bits [7:4] in ADI
// register 7, - only bits selected
// by mask M1H will be affected by
// access
#define ADI_MASK4B67_D1H_S      24
#define ADI_MASK4B67_M1L_M      0x00F00000  // Mask for bits [3:0] in ADI
// register 7
#define ADI_MASK4B67_M1L_S      20
#define ADI_MASK4B67_D1L_M      0x000F0000  // Data for bits [3:0] in ADI
// register 7, - only bits selected
// by mask M1L will be affected by
// access
#define ADI_MASK4B67_D1L_S      16
#define ADI_MASK4B67_M0H_M      0x0000F000  // Mask for bits [7:4] in ADI
// register 6
#define ADI_MASK4B67_M0H_S      12
#define ADI_MASK4B67_D0H_M      0x00000F00  // Data for bits [7:4] in ADI
// register 6, - only bits selected
// by mask M0H will be affected by
// access
#define ADI_MASK4B67_D0H_S      8
#define ADI_MASK4B67_M0L_M      0x000000F0  // Mask for bits [3:0] in ADI
// register 6
#define ADI_MASK4B67_M0L_S      4
#define ADI_MASK4B67_D0L_M      0x0000000F  // Data for bits [3:0] in ADI
// register 6, - only bits selected
// by mask M0L will be affected by
// access
#define ADI_MASK4B67_D0L_S      0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_MASK4B89 register.
//
//*****************************************************************************
#define ADI_MASK4B89_M1H_M      0xF0000000  // Mask for bits [7:4] in ADI
// register 9
#define ADI_MASK4B89_M1H_S      28
#define ADI_MASK4B89_D1H_M      0x0F000000  // Data for bits [7:4] in ADI
// register 9, - only bits selected
// by mask M1H will be affected by
// access
#define ADI_MASK4B89_D1H_S      24
#define ADI_MASK4B89_M1L_M      0x00F00000  // Mask for bits [3:0] in ADI
// register 9
#define ADI_MASK4B89_M1L_S      20
#define ADI_MASK4B89_D1L_M      0x000F0000  // Data for bits [3:0] in ADI
// register 9, - only bits selected
// by mask M1L will be affected by
// access
#define ADI_MASK4B89_D1L_S      16
#define ADI_MASK4B89_M0H_M      0x0000F000  // Mask for bits [7:4] in ADI
// register 8
#define ADI_MASK4B89_M0H_S      12
#define ADI_MASK4B89_D0H_M      0x00000F00  // Data for bits [7:4] in ADI
// register 8, - only bits selected
// by mask M0H will be affected by
// access
#define ADI_MASK4B89_D0H_S      8
#define ADI_MASK4B89_M0L_M      0x000000F0  // Mask for bits [3:0] in ADI
// register 8
#define ADI_MASK4B89_M0L_S      4
#define ADI_MASK4B89_D0L_M      0x0000000F  // Data for bits [3:0] in ADI
// register 8, - only bits selected
// by mask M0L will be affected by
// access
#define ADI_MASK4B89_D0L_S      0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK4B1011 register.
//
//*****************************************************************************
#define ADI_MASK4B1011_M1H_M    0xF0000000  // Mask for bits [7:4] in ADI
// register 11
#define ADI_MASK4B1011_M1H_S    28
#define ADI_MASK4B1011_D1H_M    0x0F000000  // Data for bits [7:4] in ADI
// register 11, - only bits
// selected by mask M1H will be
// affected by access
#define ADI_MASK4B1011_D1H_S    24
#define ADI_MASK4B1011_M1L_M    0x00F00000  // Mask for bits [3:0] in ADI
// register 11
#define ADI_MASK4B1011_M1L_S    20
#define ADI_MASK4B1011_D1L_M    0x000F0000  // Data for bits [3:0] in ADI
// register 11, - only bits
// selected by mask M1L will be
// affected by access
#define ADI_MASK4B1011_D1L_S    16
#define ADI_MASK4B1011_M0H_M    0x0000F000  // Mask for bits [7:4] in ADI
// register 10
#define ADI_MASK4B1011_M0H_S    12
#define ADI_MASK4B1011_D0H_M    0x00000F00  // Data for bits [7:4] in ADI
// register 10, - only bits
// selected by mask M0H will be
// affected by access
#define ADI_MASK4B1011_D0H_S    8
#define ADI_MASK4B1011_M0L_M    0x000000F0  // Mask for bits [3:0] in ADI
// register 10
#define ADI_MASK4B1011_M0L_S    4
#define ADI_MASK4B1011_D0L_M    0x0000000F  // Data for bits [3:0] in ADI
// register 10, - only bits
// selected by mask M0L will be
// affected by access
#define ADI_MASK4B1011_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK4B1213 register.
//
//*****************************************************************************
#define ADI_MASK4B1213_M1H_M    0xF0000000  // Mask for bits [7:4] in ADI
// register 13
#define ADI_MASK4B1213_M1H_S    28
#define ADI_MASK4B1213_D1H_M    0x0F000000  // Data for bits [7:4] in ADI
// register 13, - only bits
// selected by mask M1H will be
// affected by access
#define ADI_MASK4B1213_D1H_S    24
#define ADI_MASK4B1213_M1L_M    0x00F00000  // Mask for bits [3:0] in ADI
// register 13
#define ADI_MASK4B1213_M1L_S    20
#define ADI_MASK4B1213_D1L_M    0x000F0000  // Data for bits [3:0] in ADI
// register 13, - only bits
// selected by mask M1L will be
// affected by access
#define ADI_MASK4B1213_D1L_S    16
#define ADI_MASK4B1213_M0H_M    0x0000F000  // Mask for bits [7:4] in ADI
// register 12
#define ADI_MASK4B1213_M0H_S    12
#define ADI_MASK4B1213_D0H_M    0x00000F00  // Data for bits [7:4] in ADI
// register 12, - only bits
// selected by mask M0H will be
// affected by access
#define ADI_MASK4B1213_D0H_S    8
#define ADI_MASK4B1213_M0L_M    0x000000F0  // Mask for bits [3:0] in ADI
// register 12
#define ADI_MASK4B1213_M0L_S    4
#define ADI_MASK4B1213_D0L_M    0x0000000F  // Data for bits [3:0] in ADI
// register 12, - only bits
// selected by mask M0L will be
// affected by access
#define ADI_MASK4B1213_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK4B1415 register.
//
//*****************************************************************************
#define ADI_MASK4B1415_M1H_M    0xF0000000  // Mask for bits [7:4] in ADI
// register 15
#define ADI_MASK4B1415_M1H_S    28
#define ADI_MASK4B1415_D1H_M    0x0F000000  // Data for bits [7:4] in ADI
// register 15, - only bits
// selected by mask M1H will be
// affected by access
#define ADI_MASK4B1415_D1H_S    24
#define ADI_MASK4B1415_M1L_M    0x00F00000  // Mask for bits [3:0] in ADI
// register 15
#define ADI_MASK4B1415_M1L_S    20
#define ADI_MASK4B1415_D1L_M    0x000F0000  // Data for bits [3:0] in ADI
// register 15, - only bits
// selected by mask M1L will be
// affected by access
#define ADI_MASK4B1415_D1L_S    16
#define ADI_MASK4B1415_M0H_M    0x0000F000  // Mask for bits [7:4] in ADI
// register 14
#define ADI_MASK4B1415_M0H_S    12
#define ADI_MASK4B1415_D0H_M    0x00000F00  // Data for bits [7:4] in ADI
// register 14, - only bits
// selected by mask M0H will be
// affected by access
#define ADI_MASK4B1415_D0H_S    8
#define ADI_MASK4B1415_M0L_M    0x000000F0  // Mask for bits [3:0] in ADI
// register 14
#define ADI_MASK4B1415_M0L_S    4
#define ADI_MASK4B1415_D0L_M    0x0000000F  // Data for bits [3:0] in ADI
// register 14, - only bits
// selected by mask M0L will be
// affected by access
#define ADI_MASK4B1415_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_MASK8B01 register.
//
//*****************************************************************************
#define ADI_MASK8B01_M1_M       0xFF000000  // Mask for ADI register 1
#define ADI_MASK8B01_M1_S       24
#define ADI_MASK8B01_D1_M       0x00FF0000  // Data for ADI register 1, - only
// bits selected by mask M1 will be
// affected by access
#define ADI_MASK8B01_D1_S       16
#define ADI_MASK8B01_M0_M       0x0000FF00  // Mask for ADI register 0
#define ADI_MASK8B01_M0_S       8
#define ADI_MASK8B01_D0_M       0x000000FF  // Data for ADI register 0, - only
// bits selected by mask M0 will be
// affected by access
#define ADI_MASK8B01_D0_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_MASK8B23 register.
//
//*****************************************************************************
#define ADI_MASK8B23_M1_M       0xFF000000  // Mask for ADI register 3
#define ADI_MASK8B23_M1_S       24
#define ADI_MASK8B23_D1_M       0x00FF0000  // Data for ADI register 3, - only
// bits selected by mask M1 will be
// affected by access
#define ADI_MASK8B23_D1_S       16
#define ADI_MASK8B23_M0_M       0x0000FF00  // Mask for ADI register 2
#define ADI_MASK8B23_M0_S       8
#define ADI_MASK8B23_D0_M       0x000000FF  // Data for ADI register 2, - only
// bits selected by mask M0 will be
// affected by access
#define ADI_MASK8B23_D0_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_MASK8B45 register.
//
//*****************************************************************************
#define ADI_MASK8B45_M1_M       0xFF000000  // Mask for ADI register 5
#define ADI_MASK8B45_M1_S       24
#define ADI_MASK8B45_D1_M       0x00FF0000  // Data for ADI register 5, - only
// bits selected by mask M1 will be
// affected by access
#define ADI_MASK8B45_D1_S       16
#define ADI_MASK8B45_M0_M       0x0000FF00  // Mask for ADI register 4
#define ADI_MASK8B45_M0_S       8
#define ADI_MASK8B45_D0_M       0x000000FF  // Data for ADI register 4, - only
// bits selected by mask M0 will be
// affected by access
#define ADI_MASK8B45_D0_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_MASK8B67 register.
//
//*****************************************************************************
#define ADI_MASK8B67_M1_M       0xFF000000  // Mask for ADI register 7
#define ADI_MASK8B67_M1_S       24
#define ADI_MASK8B67_D1_M       0x00FF0000  // Data for ADI register 7, - only
// bits selected by mask M1 will be
// affected by access
#define ADI_MASK8B67_D1_S       16
#define ADI_MASK8B67_M0_M       0x0000FF00  // Mask for ADI register 6
#define ADI_MASK8B67_M0_S       8
#define ADI_MASK8B67_D0_M       0x000000FF  // Data for ADI register 6, - only
// bits selected by mask M0 will be
// affected by access
#define ADI_MASK8B67_D0_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_MASK8B89 register.
//
//*****************************************************************************
#define ADI_MASK8B89_M1_M       0xFF000000  // Mask for ADI register 9
#define ADI_MASK8B89_M1_S       24
#define ADI_MASK8B89_D1_M       0x00FF0000  // Data for ADI register 9, - only
// bits selected by mask M1 will be
// affected by access
#define ADI_MASK8B89_D1_S       16
#define ADI_MASK8B89_M0_M       0x0000FF00  // Mask for ADI register 8
#define ADI_MASK8B89_M0_S       8
#define ADI_MASK8B89_D0_M       0x000000FF  // Data for ADI register 8, - only
// bits selected by mask M0 will be
// affected by access
#define ADI_MASK8B89_D0_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK8B1011 register.
//
//*****************************************************************************
#define ADI_MASK8B1011_M1_M     0xFF000000  // Mask for ADI register 11
#define ADI_MASK8B1011_M1_S     24
#define ADI_MASK8B1011_D1_M     0x00FF0000  // Data for ADI register 11, -
// only bits selected by mask M1
// will be affected by access
#define ADI_MASK8B1011_D1_S     16
#define ADI_MASK8B1011_M0_M     0x0000FF00  // Mask for ADI register 10
#define ADI_MASK8B1011_M0_S     8
#define ADI_MASK8B1011_D0_M     0x000000FF  // Data for ADI register 10, -
// only bits selected by mask M0
// will be affected by access
#define ADI_MASK8B1011_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK8B1213 register.
//
//*****************************************************************************
#define ADI_MASK8B1213_M1_M     0xFF000000  // Mask for ADI register 13
#define ADI_MASK8B1213_M1_S     24
#define ADI_MASK8B1213_D1_M     0x00FF0000  // Data for ADI register 13, -
// only bits selected by mask M1
// will be affected by access
#define ADI_MASK8B1213_D1_S     16
#define ADI_MASK8B1213_M0_M     0x0000FF00  // Mask for ADI register 12
#define ADI_MASK8B1213_M0_S     8
#define ADI_MASK8B1213_D0_M     0x000000FF  // Data for ADI register 12, -
// only bits selected by mask M0
// will be affected by access
#define ADI_MASK8B1213_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK8B1415 register.
//
//*****************************************************************************
#define ADI_MASK8B1415_M1_M     0xFF000000  // Mask for ADI register 15
#define ADI_MASK8B1415_M1_S     24
#define ADI_MASK8B1415_D1_M     0x00FF0000  // Data for ADI register 15, -
// only bits selected by mask M1
// will be affected by access
#define ADI_MASK8B1415_D1_S     16
#define ADI_MASK8B1415_M0_M     0x0000FF00  // Mask for ADI register 14
#define ADI_MASK8B1415_M0_S     8
#define ADI_MASK8B1415_D0_M     0x000000FF  // Data for ADI register 14, -
// only bits selected by mask M0
// will be affected by access
#define ADI_MASK8B1415_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B01 register.
//
//*****************************************************************************
#define ADI_MASK16B01_M_M       0xFFFF0000  // Mask for ADI register 0 and 1
#define ADI_MASK16B01_M_S       16
#define ADI_MASK16B01_D_M       0x0000FFFF  // Data for ADI register at
// offsets 0 and 1, - only bits
// selected by mask M will be
// affected by access
#define ADI_MASK16B01_D_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B23 register.
//
//*****************************************************************************
#define ADI_MASK16B23_M_M       0xFFFF0000  // Mask for ADI register 2 and 3
#define ADI_MASK16B23_M_S       16
#define ADI_MASK16B23_D_M       0x0000FFFF  // Data for ADI register at
// offsets 2 and 3, - only bits
// selected by mask M will be
// affected by access
#define ADI_MASK16B23_D_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B45 register.
//
//*****************************************************************************
#define ADI_MASK16B45_M_M       0xFFFF0000  // Mask for ADI register 4 and 5
#define ADI_MASK16B45_M_S       16
#define ADI_MASK16B45_D_M       0x0000FFFF  // Data for ADI register at
// offsets 4 and 5, - only bits
// selected by mask M will be
// affected by access
#define ADI_MASK16B45_D_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B67 register.
//
//*****************************************************************************
#define ADI_MASK16B67_M_M       0xFFFF0000  // Mask for ADI register 6 and 7
#define ADI_MASK16B67_M_S       16
#define ADI_MASK16B67_D_M       0x0000FFFF  // Data for ADI register at
// offsets 6 and 7, - only bits
// selected by mask M will be
// affected by access
#define ADI_MASK16B67_D_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B89 register.
//
//*****************************************************************************
#define ADI_MASK16B89_M_M       0xFFFF0000  // Mask for ADI register 8 and 9
#define ADI_MASK16B89_M_S       16
#define ADI_MASK16B89_D_M       0x0000FFFF  // Data for ADI register at
// offsets 8 and 9, - only bits
// selected by mask M will be
// affected by access
#define ADI_MASK16B89_D_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B1011 register.
//
//*****************************************************************************
#define ADI_MASK16B1011_M_M     0xFFFF0000  // Mask for ADI register 10 and 11
#define ADI_MASK16B1011_M_S     16
#define ADI_MASK16B1011_D_M     0x0000FFFF  // Data for ADI register at
// offsets 10 and 11, - only bits
// selected by mask M will be
// affected by access
#define ADI_MASK16B1011_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B1213 register.
//
//*****************************************************************************
#define ADI_MASK16B1213_M_M     0xFFFF0000  // Mask for ADI register 12 and 13
#define ADI_MASK16B1213_M_S     16
#define ADI_MASK16B1213_D_M     0x0000FFFF  // Data for ADI register at
// offsets 12 and 13, - only bits
// selected by mask M will be
// affected by access
#define ADI_MASK16B1213_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B1415 register.
//
//*****************************************************************************
#define ADI_MASK16B1415_M_M     0xFFFF0000  // Mask for ADI register 14 and 15
#define ADI_MASK16B1415_M_S     16
#define ADI_MASK16B1415_D_M     0x0000FFFF  // Data for ADI register at
// offsets 14 and 15, - only bits
// selected by mask M will be
// affected by access
#define ADI_MASK16B1415_D_S     0

#endif // __HW_ADI_H__
